/*****************************************************************************
 *   Copyright(C)2009-2019 by VSF Team                                       *
 *                                                                           *
 *  Licensed under the Apache License, Version 2.0 (the "License");          *
 *  you may not use this file except in compliance with the License.         *
 *  You may obtain a copy of the License at                                  *
 *                                                                           *
 *     http://www.apache.org/licenses/LICENSE-2.0                            *
 *                                                                           *
 *  Unless required by applicable law or agreed to in writing, software      *
 *  distributed under the License is distributed on an "AS IS" BASIS,        *
 *  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. *
 *  See the License for the specific language governing permissions and      *
 *  limitations under the License.                                           *
 *                                                                           *
 ****************************************************************************/

#ifndef __F1C100S_REG_H__
#define __F1C100S_REG_H__

/*============================ INCLUDES ======================================*/

/*! \note i_reg_xxxx.h header files must be standalong and assume following 

#define REG16_RSVD_2K               REG16_RSVD_B(2048)
#define REG16_RSVD_4K               REG16_RSVD_B(4096)
#define REG16_RSVD_8K               REG16_RSVD_B(8192)
#define REG16_RSVD_16K              REG16_RSVD_B(16 * 1024)
#define REG16_RSVD_32K              REG16_RSVD_B(32 * 1024)
#define REG16_RSVD_64K              REG16_RSVD_B(64 * 1024)
#define REG16_RSVD_128K             REG16_RSVD_B(128 * 1024)
#define REG16_RSVD_256K             REG16_RSVD_B(256 * 1024)
#define REG16_RSVD_512K             REG16_RSVD_B(512 * 1024)
#define REG16_RSVD_1M               REG16_RSVD_B(1024 * 1024)

#define REG32_RSVD_N(__N)           REG_RSVD_U32N(__N)
// __BYTE_CNT MUST be mutiple of 4
#define REG32_RSVD_B(__BYTE_CNT)    REG_RSVD_U32N(__BYTE_CNT >> 2)
#define REG32_RSVD_8B               REG32_RSVD_B(8)
#define REG32_RSVD_16B              REG32_RSVD_B(16)
#define REG32_RSVD_32B              REG32_RSVD_B(32)
#define REG32_RSVD_64B              REG32_RSVD_B(64)
#define REG32_RSVD_128B             REG32_RSVD_B(128)
#define REG32_RSVD_256B             REG32_RSVD_B(256)
#define REG32_RSVD_512B             REG32_RSVD_B(512)
#define REG32_RSVD_1K               REG32_RSVD_B(1024)
#define REG32_RSVD_2K               REG32_RSVD_B(2048)
#define REG32_RSVD_4K               REG32_RSVD_B(4096)
#define REG32_RSVD_8K               REG32_RSVD_B(8192)
#define REG32_RSVD_16K              REG32_RSVD_B(16 * 1024)
#define REG32_RSVD_32K              REG32_RSVD_B(32 * 1024)
#define REG32_RSVD_64K              REG32_RSVD_B(64 * 1024)
#define REG32_RSVD_128K             REG32_RSVD_B(128 * 1024)
#define REG32_RSVD_256K             REG32_RSVD_B(256 * 1024)
#define REG32_RSVD_512K             REG32_RSVD_B(512 * 1024)
#define REG32_RSVD_1M               REG32_RSVD_B(1024 * 1024)

#endif      // __REG_TYPE__

typedef enum IRQn
{
    UART0_IRQn          = 1,
    UART1_IRQn,
    UART2_IRQn,
    OWA_IRQn            = 5,
    CIR_IRQn,
    TWI0_IRQn,
    TWI1_IRQn,                               /*!< IRQ8 */
    TWI2_IRQn,
    SPI0_IRQn,
    SPI1_IRQn,
                                            /*!< IRQ12 */ 
    Timer0_IRQn         = 13,
    Timer1_IRQn,
    Timer2_IRQn,
    WatchDog_IRQn,                           /*!< IRQ16 */
    RSB_IRQn,
    DMA_IRQn,

    TouchPanel_IRQn     = 20,               /*!< IRQ20 */
    AudioCodec_IRQn,
    KEYADC_IRQn,
    SDC0_IRQn,
    SDC1_IRQn,                               /*!< IRQ24 */
                         
    USBOTG_IRQn         = 26,
    TVD_IRQn,
    TVE_IRQn,                                /*!< IRQ28 */
    TCON_IRQn,
    DEFE_IRQn,
    DEBE_IRQn,
    CSI_IRQn,                                /*!< IRQ32 */
    DEInterlacer_IRQn,
    VE_IRQn,
    DAUDIO_IRQn,

    PIOD_IRQn           = 38,
    PIOE_IRQn,
    PIOF_IRQn,                               /*!< IRQ40 */

    SWI0_IRQn           = 60,               /*!< IRQ60 */
    SWI1_IRQn,
    SWI2_IRQn,
    SWI3_IRQn,
}IRQn_Type;



typedef struct syscon_reg_t {
    REG_RSVD_U32N(1)
    reg32_t USB_CTRL;
} syscon_reg_t;

typedef struct ccu_reg_t {
    reg32_t PLL_CPU_CTRL;                           // 0x000
    REG_RSVD_U32N(1)
    reg32_t PLL_AUDIO_CTRL;                         // 0x008
    REG_RSVD_U32N(1)
    reg32_t PLL_VIDEO_CTRL;                         // 0x010
    REG_RSVD_U32N(1)
    reg32_t PLL_VE_CTRL;                            // 0x018
    REG_RSVD_U32N(1)
    reg32_t PLL_DDR_CTRL;                           // 0x020
    REG_RSVD_U32N(1)
    reg32_t PLL_PERIPH_CTRL;                        // 0x028
    REG_RSVD_U32N(9)
    reg32_t CPU_CLK_SRC;                            // 0x050
    reg32_t AHB_APB_HCLKC_CFG;                      // 0x054
    REG_RSVD_U32N(2)
    reg32_t BUS_CLK_GATING0;                        // 0x060
    reg32_t BUS_CLK_GATING1;                        // 0x064
    reg32_t BUS_CLK_GATING2;                        // 0x068
    REG_RSVD_U32N(7)
    reg32_t SDMMC0_CLK;                             // 0x088
    reg32_t SDMMC1_CLK;                             // 0x08c
    REG_RSVD_U32N(8)
    reg32_t DAUDIO_CLK;                             // 0x0b0
    reg32_t OWA_CLK;                                // 0x0b4
    reg32_t CIR_CLK;                                // 0x0b8
    REG_RSVD_U32N(4)
    reg32_t USBPHY_CLK;                             // 0x0cc
    REG_RSVD_U32N(12)
    reg32_t DRAM_GATING;                            // 0x100
    reg32_t BE_CLK;                                 // 0x104
    REG_RSVD_U32N(1)
    reg32_t FE_CLK;                                 // 0x10c
    REG_RSVD_U32N(2)
    reg32_t TCON_CLK;                               // 0x118
    reg32_t DI_CLK;                                 // 0x11c
    reg32_t TVE_CLK;                                // 0x120
    reg32_t TVD_CLK;                                // 0x124
    REG_RSVD_U32N(3)
    reg32_t CSI_CLK;                                // 0x134
    REG_RSVD_U32N(1)
    reg32_t VE_CLK;                                 // 0x13c
    reg32_t AUDIO_CODEC_CLK;                        // 0x140
    reg32_t AVS_CLK;                                // 0x144
    REG_RSVD_U32N(46)
    reg32_t PLL_STABLE_TIME0;                       // 0x200
    reg32_t PLL_STABLE_TIME1;                       // 0x204
    REG_RSVD_U32N(6)
    reg32_t PLL_CPU_BIAS;                           // 0x220
    reg32_t PLL_AUDIO_BIAS;                         // 0x224
    reg32_t PLL_VIDEO_BIAS;                         // 0x228
    reg32_t PLL_VE_BIAS;                            // 0x22c
    reg32_t PLL_DDR0_BIAS;                          // 0x230
    reg32_t PLL_PERIPH_BIAS;                        // 0x234
    REG_RSVD_U32N(6)
    reg32_t PLL_CPU_TUN;                            // 0x250
    REG_RSVD_U32N(3)
    reg32_t PLL_DDR_TUN;                            // 0x260
    REG_RSVD_U32N(8)
    reg32_t PLL_AUDIO_PAT_CTRL;                     // 0x284
    reg32_t PLL_VIDEO_PAT_CTRL;                     // 0x288
    REG_RSVD_U32N(1)
    reg32_t PLL_DDR0_PAT_CTRL;                      // 0x290
    REG_RSVD_U32N(11)
    reg32_t BUS_SOFT_RST0;                          // 0x2c0
    reg32_t BUS_SOFT_RST1;                          // 0x2c4
    REG_RSVD_U32N(2)
    reg32_t BUS_SOFT_RST2;                          // 0x2d0
} ccu_reg_t;

typedef struct dram_reg_t {
    reg32_t SCONR;                                  // 0x000
    reg32_t STMG0R;                                 // 0x004
    reg32_t STMG1R;                                 // 0x008
    reg32_t SCTLR;                                  // 0x00c
    reg32_t SREFR;                                  // 0x010
    reg32_t SEXTMR;                                 // 0x014
    REG_RSVD_U32N(3)
    reg32_t DDLYR;                                  // 0x024
    reg32_t DADRR;                                  // 0x028
    reg32_t DVALR;                                  // 0x02c
    reg32_t DRPTR0;                                 // 0x030
    reg32_t DRPTR1;                                 // 0x034
    reg32_t DRPTR2;                                 // 0x038
    reg32_t DRPTR3;                                 // 0x03c
    reg32_t SEFR;                                   // 0x040
    reg32_t MAE;                                    // 0x044
    reg32_t ASPR;                                   // 0x048
    reg32_t SDLY0;                                  // 0x04C
    reg32_t SDLY1;                                  // 0x050
    reg32_t SDLY2;                                  // 0x054
    REG_RSVD_U32N(42)
    reg32_t MCR0;                                   // 0x100
    reg32_t MCR1;                                   // 0x104
    reg32_t MCR2;                                   // 0x108
    reg32_t MCR3;                                   // 0x10c
    reg32_t MCR4;                                   // 0x110
    reg32_t MCR5;                                   // 0x114
    reg32_t MCR6;                                   // 0x118
    reg32_t MCR7;                                   // 0x11c
    reg32_t MCR8;                                   // 0x120
    reg32_t MCR9;                                   // 0x124
    reg32_t MCR10;                                  // 0x128
    reg32_t MCR11;                                  // 0x12c
    REG_RSVD_U32N(4)
    reg32_t BWCR;                                   // 0x140
} dram_reg_t;

typedef struct pio_port_t {
    reg32_t CFG0;
    reg32_t CFG1;
    reg32_t CFG2;
    reg32_t CFG3;
    reg32_t DATA;
    reg32_t DRV0;
    reg32_t DRV1;
    reg32_t PUL0;
    reg32_t PUL1;
} pio_port_t;

typedef struct pio_port_int_t {
    reg32_t INT_CFG0;
    reg32_t INT_CFG1;
    reg32_t INT_CFG2;
    reg32_t INT_CFG3;
    reg32_t INT_CTRL;
    reg32_t INT_STA;
    reg32_t INT_DEB;
    REG_RSVD_U32N(1)
} pio_port_int_t;

typedef struct pio_reg_t {
    union {
        pio_port_t PORT[6];
        struct {
            pio_port_t PORTA;
            pio_port_t PORTB;
            pio_port_t PORTC;
            pio_port_t PORTD;
            pio_port_t PORTE;
            pio_port_t PORTF;
        };
    };
    REG_RSVD_U32N(74)
    pio_port_int_t PORT_INT[3];
    REG_RSVD_U32N(24)
    reg32_t SDR_PAD_DRV;
    reg32_t SDR_PAD_PUL;
} pio_reg_t;

typedef struct uart_reg_t {
    union {
        reg32_t RBR;                                // 0x000
        reg32_t THR;                                // 0x000
        reg32_t DLL;                                // 0x000
    };
    union {
        reg32_t DLH;                                // 0x004
        reg32_t IER;                                // 0x004
    };
    union {
        reg32_t IIR;                                // 0x008
        reg32_t FCR;                                // 0x008
    };
    reg32_t LCR;                                    // 0x00c
    reg32_t MCR;                                    // 0x010
    reg32_t LSR;                                    // 0x014
    reg32_t MSR;                                    // 0x018
    reg32_t SCH;                                    // 0x01c
    REG_RSVD_U32N(23)
    reg32_t USR;                                    // 0x07c
    reg32_t TFL;                                    // 0x080
    reg32_t RFL;                                    // 0x084
    REG_RSVD_U32N(7)
    reg32_t HALT;                                   // 0x0a4
} uart_reg_t;

typedef struct spi_reg_t {
    REG_RSVD_U32N(1)
    reg32_t GCR;                                    // 0x004
    reg32_t TCR;                                    // 0x008
    REG_RSVD_U32N(1)
    reg32_t IER;                                    // 0x010
    reg32_t ISR;                                    // 0x014
    reg32_t FCR;                                    // 0x018
    reg32_t FSR;                                    // 0x01c
    reg32_t WCR;                                    // 0x020
    reg32_t CCR;                                    // 0x024
    REG_RSVD_U32N(2)
    reg32_t MBC;                                    // 0x030
    reg32_t MTC;                                    // 0x034
    reg32_t BCC;                                    // 0x038
    REG_RSVD_U32N(113)
    union {
        reg32_t TXD_WORD;                           // 0x200
        reg8_t TXD_BYTE;                            // 0x200
    };
    REG_RSVD_U32N(63)
    union {
        reg32_t RXD_WORD;                           // 0x300
        reg8_t RXD_BYTE;                            // 0x300
    };
} spi_reg_t;

typedef struct tcon_reg_t {
    reg32_t CTRL;                                   // 0x000
    reg32_t INT_REG0;                               // 0x004
    reg32_t INT_REG1;                               // 0x008
    REG_RSVD_U32N(1)
    reg32_t FRM_CTRL;                               // 0x010
    union {
        struct {
            reg32_t FRM_SEED0_R;                    // 0x014
            reg32_t FRM_SEED0_G;                    // 0x018
            reg32_t FRM_SEED0_B;                    // 0x01c
            reg32_t FRM_SEED1_R;                    // 0x020
            reg32_t FRM_SEED1_G;                    // 0x024
            reg32_t FRM_SEED1_B;                    // 0x028
        };
        reg32_t FRM_SEED[6];
    };
    union {
        struct {
            reg32_t FRM_TBL0;                       // 0x02c
            reg32_t FRM_TBL1;                       // 0x030
            reg32_t FRM_TBL2;                       // 0x034
            reg32_t FRM_TBL3;                       // 0x038
        };
        reg32_t FRM_TBL[4];
    };
    REG_RSVD_U32N(1)
    struct {
        reg32_t CTRL;                               // 0x040
        reg32_t CLK_CTRL;                           // 0x044
        reg32_t BASIC_TIMING0;                      // 0x048: ACTIVE
        reg32_t BASIC_TIMING1;                      // 0x04c: HORIZONTAL
        reg32_t BASIC_TIMING2;                      // 0x050: VERTICAL
        reg32_t BASIC_TIMING3;                      // 0x054: SYNC
        reg32_t HV_TIMING;                          // 0x058
        REG_RSVD_U32N(1)
        reg32_t CPU_IF;                             // 0x060
        reg32_t CPU_WR;                             // 0x064
        reg32_t CPU_RD;                             // 0x068
        reg32_t CPU_RD_NX;                          // 0x06c
        REG_RSVD_U32N(6)
        reg32_t IO_CTRL0;                           // 0x088: PLORITY
        reg32_t IO_CTRL1;                           // 0x08c: TRISTATE
    } TCON0;
    struct {
        reg32_t CTRL;                               // 0x090
        reg32_t BASIC0;                             // 0x094
        reg32_t BASIC1;                             // 0x098
        reg32_t BASIC2;                             // 0x09c
        reg32_t BASIC3;                             // 0x0a0
        reg32_t BASIC4;                             // 0x0a4
        reg32_t BASIC5;                             // 0x0a8
        REG_RSVD_U32N(17)
        reg32_t IO_CTRL0;                           // 0x0f0: PLORITY
        reg32_t IO_CTRL1;                           // 0x0f4: TRISATE
    } TCON1;
    REG_RSVD_U32N(1)
    reg32_t DEBUG_INFO;                             // 0x0fc
} tcon_reg_t;

typedef struct debe_reg_t {
    REG_RSVD_U32N(512)
    reg32_t MODE_CTRL;                              // 0x800
    reg32_t BACKCOLOR;                              // 0x804
    reg32_t DISP_SIZE;                              // 0x808
    REG_RSVD_U32N(1)
    reg32_t LAY_SIZE[4];                            // 0x810
    reg32_t LAY_CODNT[4];                           // 0x820
    REG_RSVD_U32N(4)
    reg32_t LAY_LINEWIDTH[4];                       // 0x840
    reg32_t LAY_FB_ADDR0[4];                        // 0x850
    reg32_t LAY_FB_ADDR1[4];                        // 0x860
    reg32_t REGBUFF_CTRL;                           // 0x870
    REG_RSVD_U32N(3)
    reg32_t CK_MAX;                                 // 0x880
    reg32_t CK_MIN;                                 // 0x884
    reg32_t CK_CFG;                                 // 0x888
    REG_RSVD_U32N(1)
    reg32_t LAY_ATT_CTRL0[4];                       // 0x890
    reg32_t LAY_ATT_CTRL1[4];                       // 0x8a0
    REG_RSVD_U32N(10)
    reg32_t HWC_CTRL;                               // 0x8d8
    REG_RSVD_U32N(1)
    reg32_t HWCFB_CTRL;                             // 0x8e0
    REG_RSVD_U32N(3)
    reg32_t WB_CTRL;                                // 0x8f0
    reg32_t WB_ADDR;                                // 0x8f4
    reg32_t WB_LW;                                  // 0x8f8
    REG_RSVD_U32N(9)
    // YUV
    reg32_t IYUV_CH_CTRL;                           // 0x920
    REG_RSVD_U32N(3)
    reg32_t CH0_YUV_FB_ADDR;                        // 0x930
    reg32_t CH1_YUV_FB_ADDR;                        // 0x934
    reg32_t CH2_YUV_FB_ADDR;                        // 0x938
    REG_RSVD_U32N(1)
    reg32_t CH0_YUV_BLW;                            // 0x940
    reg32_t CH1_YUV_BLW;                            // 0x944
    reg32_t CH2_YUV_BLW;                            // 0x948
    REG_RSVD_U32N(1)
    reg32_t COEF00;                                 // 0x950
    reg32_t COEF01;                                 // 0x954
    reg32_t COEF02;                                 // 0x958
    reg32_t COEF03;                                 // 0x95c
    reg32_t COEF10;                                 // 0x960
    reg32_t COEF11;                                 // 0x964
    reg32_t COEF12;                                 // 0x968
    reg32_t COEF13;                                 // 0x96c
    reg32_t COEF20;                                 // 0x970
    reg32_t COEF21;                                 // 0x974
    reg32_t COEF22;                                 // 0x978
    reg32_t COEF23;                                 // 0x97c
    // TODO: add cursor buffer and platte
} debe_reg_t;

typedef struct tve_reg_t {
    reg32_t ENABLE;                                 // 0x000
    reg32_t CFG0;                                   // 0x004
    reg32_t DAC1;                                   // 0x008
    reg32_t NOTCH;                                  // 0x00c
    reg32_t CHROMA_FREQUENCY;                       // 0x010
    reg32_t PORCH;                                  // 0x014
    REG_RSVD_U32N(1)
    reg32_t LINE;                                   // 0x01c
    reg32_t LEVEL;                                  // 0x020
    reg32_t DAC2;                                   // 0x024
    REG_RSVD_U32N(4)
    reg32_t DETECT_STATUS;                          // 0x038
    REG_RSVD_U32N(52)
    reg32_t CBCR_LEVEL;                             // 0x10c
    REG_RSVD_U32N(1)
    reg32_t BURST_WIDTH;                            // 0x114
    reg32_t CBCR_GAIN;                              // 0x118
    reg32_t SYNC_VBI;                               // 0x11c
    REG_RSVD_U32N(1)
    reg32_t ACTIVE_LINE;                            // 0x124
    reg32_t CHROMA;                                 // 0x128
    reg32_t ENCODER;                                // 0x12c
    reg32_t RESYNC;                                 // 0x130
    reg32_t SLAVE;                                  // 0x134
} tve_reg_t;

typedef struct timer_reg_t {
    reg32_t IRQ_EN;                                 // 0x000
    reg32_t IRQ_STA;                                // 0x004
    REG_RSVD_U32N(2)

    struct {                                        // 0x010
        reg32_t CTRL;
        reg32_t INTV_VALUE;
        reg32_t CUR_VALUE;
        REG_RSVD_U32N(1)
    } TMR[3];

    REG_RSVD_U32N(16)

    struct {
        reg32_t CNT_CTL;                            // 0x080
        reg32_t CNT0;                               // 0x084
        reg32_t CNT1;                               // 0x088
        reg32_t CNT_DIV;                            // 0x08c
    } AVS;

    REG_RSVD_U32N(4)

    struct {
        reg32_t IRQ_EN;                             // 0x0a0
        reg32_t IRQ_STA;                            // 0x0a4
        REG_RSVD_U32N(2)
        reg32_t CTRL;                               // 0x0b0
        reg32_t CFG;                                // 0x0b4
        reg32_t MODE;                               // 0x0b8
    } WDOG;
} timer_reg_t;

typedef struct musb_reg_t {
    // use naming spec form musbmhdrc document
    union {
        struct {
            reg32_t FIFO0;                          // 0x0000
            reg32_t FIFO1;                          // 0x0004
            reg32_t FIFO2;                          // 0x0008
            reg32_t FIFO3;                          // 0x000c
            reg32_t FIFO4;                          // 0x0010
            reg32_t FIFO5;                          // 0x0014
        };
        reg32_t FIFO[6];
    };
    // unused FIFO registers
    REG_RSVD_U32N(10)

    struct {
        reg8_t Power;                               // 0x0040
        reg8_t DevCtl;                              // 0x0041
        reg8_t Index;                               // 0x0042
        reg8_t Vendor0;                             // 0x0043
        reg16_t IntrTx;                             // 0x0044
        reg16_t IntrRx;                             // 0x0046
        reg16_t IntrTxE;                            // 0x0048
        reg16_t IntrRxE;                            // 0x004a
        reg8_t IntrUSB;                             // 0x004c
        REG_RSVD_U8N(3)
        reg8_t IntrUSBE;                            // 0x0050
        REG_RSVD_U8N(3)
        reg16_t Frame;                              // 0x0054
        REG_RSVD_U8N(34)
        reg8_t EPInfo;                              // 0x0078
        reg8_t RAMInfo;                             // 0x0079
        reg8_t LinkInfo;                            // 0x007a
        reg8_t VPLen;                               // 0x007b
        reg8_t Testmode;                            // 0x007c
        reg8_t Vendor1;                             // 0x007d
        reg8_t Vendor2;                             // 0x007e
        REG_RSVD_U8N(1)
    } Common;

    struct {
        union {
            struct {
                union {
                    struct {
                        REG_RSVD_U16N(1)
                        reg16_t CSR0;               // 0x0082
                        REG_RSVD_U16N(2)
                        reg16_t Count0;             // 0x0088
                        REG_RSVD_U16N(3)
                    } EP0;
                    struct {
                        reg16_t TxMaxP;             // 0x0080
                        reg8_t TxCSRL;              // 0x0082
                        reg8_t TxCSRH;              // 0x0083
                        reg16_t RxMaxP;             // 0x0084
                        reg8_t RxCSRL;              // 0x0086
                        reg8_t RxCSRH;              // 0x0087
                        reg16_t RxCount;            // 0x0088
                        REG_RSVD_U16N(3)
                    } EPN;
                };
            } DC;
            struct {
                union {
                    struct {
                        REG_RSVD_U16N(1)
                        reg16_t CSR0;               // 0x0082
                        REG_RSVD_U16N(2)
                        reg16_t Count0;             // 0x0088
                        REG_RSVD_U16N(1)
                        reg8_t Type0;               // 0x008c
                        reg8_t NAKLimit0;           // 0x008d
                        REG_RSVD_U16N(1)
                    } EP0;
                    struct {
                        reg16_t TxMaxP;             // 0x0080
                        reg8_t TxCSRL;              // 0x0082
                        reg8_t TxCSRH;              // 0x0083
                        reg16_t RxMaxP;             // 0x0084
                        reg8_t RxCSRL;              // 0x0086
                        reg8_t RxCSRH;              // 0x0087
                        reg16_t RxCount;            // 0x0088
                        REG_RSVD_U16N(1)
                        reg8_t TxType;              // 0x008c
                        reg8_t TxInterval;          // 0x008d
                        reg8_t RxType;              // 0x008e
                        reg8_t RxInterval;          // 0x008f
                    } EPN;
                };
            } HC;
        };

        reg8_t TxFIFOsz;                            // 0x0090
        REG_RSVD_U8N(1)
        reg16_t TxFIFOadd;                          // 0x0092
        reg8_t RxFIFOsz;                            // 0x0094
        REG_RSVD_U8N(1)
        reg16_t RxFIFOadd;                          // 0x0096
        reg8_t TxFuncAddr;                          // 0x0098
        REG_RSVD_U8N(1)
        reg8_t TxHubAddr;                           // 0x009a
        reg8_t TxHubPort;                           // 0x009b
        reg8_t RxFuncAddr;                          // 0x009c
        REG_RSVD_U8N(1)
        reg8_t RxHubAddr;                           // 0x009e
        reg8_t RxHubPort;                           // 0x009f
    } Index;

    REG_RSVD_U32N(216)
    struct {
        reg32_t ISCR;                               // 0x0400
        reg32_t PHYCTL;                             // 0x0404
        reg32_t PHYBIST;                            // 0x0408
        reg32_t PHYTUNE;                            // 0x040c
    } Vendor;
} musb_reg_t;

typedef struct tp_reg_t {
    reg32_t CTRL0;                                  // 0x00
    reg32_t CTRL1;                                  // 0x04
    reg32_t CTRL2;                                  // 0x08
    reg32_t CTRL3;                                  // 0x0c
    reg32_t INT_FIFOC;                              // 0x10
    reg32_t INT_FIFOS;                              // 0x14
    reg32_t TPR;                                    // 0x18
    reg32_t CDAT;                                   // 0x1c
    reg32_t TEMP_DATA;                              // 0x20
    reg32_t DATA;                                   // 0x24
} tp_reg_t;

/*============================ GLOBAL VARIABLES ==============================*/
/*============================ LOCAL VARIABLES ===============================*/
/*============================ PROTOTYPES ====================================*/

#endif
/* EOF */
