/*****************************************************************************
 *   Copyright(C)2009-2022 by VSF Team                                       *
 *                                                                           *
 *  Licensed under the Apache License, Version 2.0 (the "License");          *
 *  you may not use this file except in compliance with the License.         *
 *  You may obtain a copy of the License at                                  *
 *                                                                           *
 *     http://www.apache.org/licenses/LICENSE-2.0                            *
 *                                                                           *
 *  Unless required by applicable law or agreed to in writing, software      *
 *  distributed under the License is distributed on an "AS IS" BASIS,        *
 *  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. *
 *  See the License for the specific language governing permissions and      *
 *  limitations under the License.                                           *
 *                                                                           *
 ****************************************************************************/

#ifndef __VSF_TEMPLATE_SDIO_H__
#define __VSF_TEMPLATE_SDIO_H__

/*============================ INCLUDES ======================================*/

#include "./vsf_template_hal_driver.h"

#define R1_SWITCH_ERROR                 (1 << 7)    /* sx,  c */
#define R1_EXCEPTION_EVENT              (1 << 6)    /* sr,  a */
#define R1_APP_CMD                      (1 << 5)    /* sr,  c */

#define R1_STATE_IDLE                   0
#define R1_STATE_READY                  1
#define R1_STATE_IDENT                  2
#define R1_STATE_STBY                   3
#define R1_STATE_TRAN                   4
#define R1_STATE_DATA                   5
#define R1_STATE_RCV                    6
#define R1_STATE_PRG                    7
#define R1_STATE_DIS                    8
#define R1_STATE_MASK                   0x0FUL

#define R1_CUR_STATE(__S)               ((__S) << 9)

/*============================ MACROFIED FUNCTIONS ===========================*/

/**
 * \~english
 * @brief SDIO API template, used to generate SDIO type, specific prefix
 * function declarations, etc.
 * @param[in] __prefix_name The prefix used for generating SDIO functions.
 * \~chinese
 * @brief SDIO API 模板，用于生成 SDIO 类型、特定前缀的函数声明等。
 * @param[in] __prefix_name 用于生成 SDIO 函数的前缀。
 */
#define VSF_SDIO_APIS(__prefix_name)                                                                                                                                     \
    __VSF_HAL_TEMPLATE_API(__prefix_name, vsf_err_t,             sdio, init,                 VSF_MCONNECT(__prefix_name, _t) *sdio_ptr, vsf_sdio_cfg_t *cfg_ptr)         \
    __VSF_HAL_TEMPLATE_API(__prefix_name, void,                  sdio, fini,                 VSF_MCONNECT(__prefix_name, _t) *sdio_ptr)                                  \
    __VSF_HAL_TEMPLATE_API(__prefix_name, vsf_err_t,             sdio, get_configuration,    VSF_MCONNECT(__prefix_name, _t) *sdio_ptr, vsf_sdio_cfg_t *cfg_ptr)         \
    __VSF_HAL_TEMPLATE_API(__prefix_name, void,                  sdio, irq_enable,           VSF_MCONNECT(__prefix_name, _t) *sdio_ptr, vsf_sdio_irq_mask_t irq_mask)    \
    __VSF_HAL_TEMPLATE_API(__prefix_name, void,                  sdio, irq_disable,          VSF_MCONNECT(__prefix_name, _t) *sdio_ptr, vsf_sdio_irq_mask_t irq_mask)    \
    __VSF_HAL_TEMPLATE_API(__prefix_name, vsf_sdio_status_t,     sdio, status,               VSF_MCONNECT(__prefix_name, _t) *sdio_ptr)                                  \
    __VSF_HAL_TEMPLATE_API(__prefix_name, vsf_sdio_capability_t, sdio, capability,           VSF_MCONNECT(__prefix_name, _t) *sdio_ptr)                                  \
    __VSF_HAL_TEMPLATE_API(__prefix_name, vsf_err_t,             sdio, set_clock,            VSF_MCONNECT(__prefix_name, _t) *sdio_ptr, uint32_t clock_hz, bool is_ddr)  \
    __VSF_HAL_TEMPLATE_API(__prefix_name, vsf_err_t,             sdio, set_bus_width,        VSF_MCONNECT(__prefix_name, _t) *sdio_ptr, uint8_t bus_width)               \
    __VSF_HAL_TEMPLATE_API(__prefix_name, vsf_err_t,             sdio, host_request,         VSF_MCONNECT(__prefix_name, _t) *sdio_ptr, vsf_sdio_req_t *req)

/*============================ TYPES =========================================*/

typedef union vsf_sdio_csd_t {
//               name               bitlen      offset
// refer to: Part_1_Physical_Layer_Specification_Ver3.01_Final_100218.pdf
    struct {
        uint32_t ALWAY1             : 1;        //  0
        uint32_t CRC                : 7;        //  1

        // different part from mmc
        uint32_t                    : 2;        //  8

        uint32_t FILE_FORMAT        : 2;        //  10
        uint32_t TMP_WRITE_PROTECT  : 1;        //  12
        uint32_t PERM_WRITE_PROTECT : 1;        //  13
        uint32_t COPY               : 1;        //  14
        uint32_t FILE_FORMAT_GRP    : 1;        //  15

        // different part from mmc
        uint32_t                    : 5;        //  16

        uint32_t WRITE_BL_PARTIAL   : 1;        //  21
        uint32_t WRITE_BL_LEN       : 4;        //  22
        uint32_t R2W_FACTOR         : 3;        //  26

        // different part from mmc
        uint32_t                    : 2;        //  29

        uint32_t WP_GRP_ENABLE      : 1;        //  31
        uint32_t WP_GRP_SIZE        : 7;        //  32
        uint32_t SECTOR_SIZE        : 7;        //  39
        uint32_t ERASE_BLK_EN       : 1;        //  46

        // different part from sd_v2
        uint32_t C_SIZE_MULT        : 3;        //  47
        uint32_t VDD_W_CURR_MAX     : 3;        //  50
        uint32_t VDD_W_CURR_MIN     : 3;        //  53
        uint32_t VDD_R_CURR_MAX     : 3;        //  56
        uint32_t VDD_R_CURR_MIN     : 3;        //  59
        uint32_t C_SIZE             : 12;       //  62
        uint32_t                    : 2;        //  74

        uint32_t DSR_IMP            : 1;        //  76
        uint32_t READ_BLK_MISALIGN  : 1;        //  77
        uint32_t WRITE_BLK_MISALIGN : 1;        //  78
        uint32_t READ_BL_PARTIAL    : 1;        //  79
        uint32_t READ_BL_LEN        : 4;        //  80
        uint32_t CCC                : 12;       //  84
        uint32_t TRANS_SPEED        : 8;        //  96
        uint32_t NSAC               : 8;        //  104
        uint32_t TAAC               : 8;        //  112

        // different part from mmc
        uint32_t                    : 6;        //  120

        uint32_t CSD_STRUCTURE      : 2;        //  126
    } VSF_CAL_PACKED sd_v1;
// refer to: Part_1_Physical_Layer_Specification_Ver3.01_Final_100218.pdf
    struct {
        uint32_t                    : 1;        //  0
        uint32_t CRC                : 7;        //  1

        // different part from mmc
        uint32_t                    : 2;        //  8

        uint32_t FILE_FORMAT        : 2;        //  10
        uint32_t TMP_WRITE_PROTECT  : 1;        //  12
        uint32_t PERM_WRITE_PROTECT : 1;        //  13
        uint32_t COPY               : 1;        //  14
        uint32_t FILE_FORMAT_GRP    : 1;        //  15

        // different part from mmc
        uint32_t                    : 5;        //  16

        uint32_t WRITE_BL_PARTIAL   : 1;        //  21
        uint32_t WRITE_BL_LEN       : 4;        //  22
        uint32_t R2W_FACTOR         : 3;        //  26

        // different part from mmc
        uint32_t                    : 2;        //  29

        uint32_t WP_GRP_ENABLE      : 1;        //  31
        uint32_t WP_GRP_SIZE        : 7;        //  32
        uint32_t SECTOR_SIZE        : 7;        //  39
        uint32_t ERASE_BLK_EN       : 1;        //  46

        // different part from sd_v1 and mmc
        uint32_t                    : 1;        //  47
        uint32_t C_SIZE             : 22;       //  48
        uint32_t                    : 6;        //  70

        uint32_t DSR_IMP            : 1;        //  76
        uint32_t READ_BLK_MISALIGN  : 1;        //  77
        uint32_t WRITE_BLK_MISALIGN : 1;        //  78
        uint32_t READ_BL_PARTIAL    : 1;        //  79
        uint32_t READ_BL_LEN        : 4;        //  80
        uint32_t CCC                : 12;       //  84
        uint32_t TRANS_SPEED        : 8;        //  96
        uint32_t NSAC               : 8;        //  104
        uint32_t TAAC               : 8;        //  112

        // different part from mmc
        uint32_t                    : 2;        //  120

        uint32_t CSD_STRUCTURE      : 2;        //  126
    } VSF_CAL_PACKED sd_v2;
// refer to: mmc specification
    struct {
        uint32_t                    : 1;        //  0
        uint32_t CRC                : 7;        //  1

        // different part from sd_v1 and sd_v2
        uint32_t ECC                : 2;        //  8

        uint32_t FILE_FORMAT        : 2;        //  10
        uint32_t TMP_WRITE_PROTECT  : 1;        //  12
        uint32_t PERM_WRITE_PROTECT : 1;        //  13
        uint32_t COPY               : 1;        //  14
        uint32_t FILE_FORMAT_GRP    : 1;        //  15

        // different part from sd_v1 and sd_v2
        uint32_t CONTENT_PROT_APP   : 1;        //  16
        uint32_t                    : 4;        //  17

        uint32_t WRITE_BL_PARTIAL   : 1;        //  21
        uint32_t WRITE_BL_LEN       : 4;        //  22
        uint32_t R2W_FACTOR         : 3;        //  26

        // different part from sd_v1 and sd_v2
        uint32_t DEFAULT_ECC        : 2;        //  29

        uint32_t WP_GRP_ENABLE      : 1;        //  31

        // different part from sd_v1 and sd_v2
        uint32_t WP_GRP_SIZE        : 5;        //  32
        uint32_t ERASE_GRP_MULT     : 5;        //  37
        uint32_t ERASE_GRP_SIZE     : 5;        //  42

        // different part from sd_v2
        uint32_t C_SIZE_MULT        : 3;        //  47
        uint32_t VDD_W_CURR_MAX     : 3;        //  50
        uint32_t VDD_W_CURR_MIN     : 3;        //  53
        uint32_t VDD_R_CURR_MAX     : 3;        //  56
        uint32_t VDD_R_CURR_MIN     : 3;        //  59
        uint32_t C_SIZE             : 12;       //  62
        uint32_t                    : 2;        //  74

        uint32_t DSR_IMP            : 1;        //  76
        uint32_t READ_BLK_MISALIGN  : 1;        //  77
        uint32_t WRITE_BLK_MISALIGN : 1;        //  78
        uint32_t READ_BL_PARTIAL    : 1;        //  79
        uint32_t READ_BL_LEN        : 4;        //  80
        uint32_t CCC                : 12;       //  84
        uint32_t TRANS_SPEED        : 8;        //  96
        uint32_t NSAC               : 8;        //  104
        uint32_t TAAC               : 8;        //  112

        // different part from sd_v1 and sd_v2
        uint32_t                    : 2;        //  120
        uint32_t SPEC_VERS          : 4;        //  122

        uint32_t CSD_STRUCTURE      : 2;        //  126
    } VSF_CAL_PACKED mmc;
} VSF_CAL_PACKED vsf_sdio_csd_t;

typedef struct vsf_sdio_cid_t {
// refer to: Part_1_Physical_Layer_Specification_Ver3.01_Final_100218.pdf
    uint64_t                        : 1;        //  0
    uint64_t CRC                    : 7;        //  1
    uint64_t MDT                    : 12;       //  8   Manufacturing date
    uint64_t                        : 4;        //  20
    uint64_t PSN                    : 32;       //  24  Product serial number
    uint64_t PRV                    : 8;        //  56  Product revision
    uint64_t PNM                    : 40;       //  64  Product name
    uint64_t OID                    : 16;       //  104 OEM/Application ID
    uint64_t MID                    : 8;        //  120 Manufacturer ID
} VSF_CAL_PACKED vsf_sdio_cid_t;

#if VSF_SDIO_CFG_REIMPLEMENT_TYPE_MODE == DISABLED
typedef enum vsf_sdio_mode_t {
    SDIO_MODE_HOST                  = (0x1ul << 0), // select host mode
    SDIO_MODE_SLAVE                 = (0x0ul << 0), // select slave mode
    SDIO_MODE_MASK                  = (0x1ul << 0),
} vsf_sdio_mode_t;
#endif

/**
 \~english
 @brief flags of sdio request operations
 @note vsf_sdio_reqop_t is implemented by specific driver.

 \~chinese
 @brief sdio 传输操作的标志
 @note vsf_sdio_reqop_t 由具体驱动实现。
 */
